## Plan Result (prod-shutter)




<pre><code>Plan: 11 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.shutter.azurerm_cdn_endpoint.shutter_endpoint[&#34;vh-admin-web&#34;]
  * module.shutter.azurerm_cdn_endpoint.shutter_endpoint[&#34;vh-video-web&#34;]
  * module.shutter.azurerm_cdn_endpoint_custom_domain.this[&#34;vh-admin-web&#34;]
  * module.shutter.azurerm_cdn_endpoint_custom_domain.this[&#34;vh-video-web&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;court-tribunal-hearings&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;jd-bureau&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;jd-reply-jury-summons&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;pip-frontend&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;sds-api-mgmt&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;vh-admin-web&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;vh-video-web&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.shutter.azurerm_cdn_endpoint.shutter_endpoint["vh-admin-web"] will be created
  + resource "azurerm_cdn_endpoint" "shutter_endpoint" {
      + content_types_to_compress     = (known after apply)
      + fqdn                          = (known after apply)
      + id                            = (known after apply)
      + is_compression_enabled        = false
      + is_http_allowed               = false
      + is_https_allowed              = true
      + location                      = "westus"
      + name                          = "hmcts-admin-sds-shutter-prod"
      + origin_host_header            = "hmctsvhadminwshutterprod.z33.web.core.windows.net"
      + origin_path                   = (known after apply)
      + probe_path                    = (known after apply)
      + profile_name                  = "hmcts-shutter-vh-admin-web"
      + querystring_caching_behaviour = "IgnoreQueryString"
      + resource_group_name           = "sds-platform-prod-rg"
      + tags                          = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + origin {
          + host_name  = "hmctsvhadminwshutterprod.z33.web.core.windows.net"
          + http_port  = 80
          + https_port = 443
          + name       = "hmctsvhadminwshutterprod-z33-web-core-windows-net"
        }
    }

  # module.shutter.azurerm_cdn_endpoint.shutter_endpoint["vh-video-web"] will be created
  + resource "azurerm_cdn_endpoint" "shutter_endpoint" {
      + content_types_to_compress     = (known after apply)
      + fqdn                          = (known after apply)
      + id                            = (known after apply)
      + is_compression_enabled        = false
      + is_http_allowed               = false
      + is_https_allowed              = true
      + location                      = "westus"
      + name                          = "hmcts-video-sds-shutter-prod"
      + origin_host_header            = "hmctsvhvideowshutterprod.z33.web.core.windows.net"
      + origin_path                   = (known after apply)
      + probe_path                    = (known after apply)
      + profile_name                  = "hmcts-shutter-vh-video-web"
      + querystring_caching_behaviour = "IgnoreQueryString"
      + resource_group_name           = "sds-platform-prod-rg"
      + tags                          = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + origin {
          + host_name  = "hmctsvhvideowshutterprod.z33.web.core.windows.net"
          + http_port  = 80
          + https_port = 443
          + name       = "hmctsvhvideowshutterprod-z33-web-core-windows-net"
        }
    }

  # module.shutter.azurerm_cdn_endpoint_custom_domain.this["vh-admin-web"] will be created
  + resource "azurerm_cdn_endpoint_custom_domain" "this" {
      + cdn_endpoint_id = (known after apply)
      + host_name       = "admin-sds.hearings.reform.hmcts.net"
      + id              = (known after apply)
      + name            = "admin-sds-hearings-reform-hmcts-net"
    }

  # module.shutter.azurerm_cdn_endpoint_custom_domain.this["vh-video-web"] will be created
  + resource "azurerm_cdn_endpoint_custom_domain" "this" {
      + cdn_endpoint_id = (known after apply)
      + host_name       = "video-sds.hearings.reform.hmcts.net"
      + id              = (known after apply)
      + name            = "video-sds-hearings-reform-hmcts-net"
    }

  # module.shutter.null_resource.enable_custom_https_cmd["court-tribunal-hearings"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "529ffe0914df4e33b9ea640cd35daefc"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["jd-bureau"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "aa5da691ac7f468bb597203bc30de7a2"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["jd-reply-jury-summons"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "551ff849e47d44c19c805e710a2b0c22"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["pip-frontend"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "529ffe0914df4e33b9ea640cd35daefc"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["sds-api-mgmt"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "529ffe0914df4e33b9ea640cd35daefc"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["vh-admin-web"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "9f24761682764ad8a98bcda56cef810f"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["vh-video-web"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "9f24761682764ad8a98bcda56cef810f"
        }
    }

Plan: 11 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":313,"Program":"tfcmt","SHA1":"","Target":"prod-shutter","Vars":{}} -->